from turtle import *

Screen().setup(1.0, 1.0)
delay(50)

# переносимось на координати човна
up()
goto(-40, -170)
down()

# малюємо човен
goto(-50, -200)
goto(-140, -200)
goto(-150, -170)
goto(-40, -170)

# переносимось на координати щогли
up()
goto(-95, -170)
down()

# малюємо щоглу
goto(-95, -60)

# малюємо вітрило
goto(-60, -100)
goto(-95, -130)

up()
goto(-170, -190)
down()
goto(-180, -190)

up()
goto(-20, -190)
down()
goto(40, -190)
goto(40, -180)

up()
goto(60, -190)
down()
goto(60, -200)
goto(20, -200)

# малюємо кита
up()
goto(160, -210)
down()
left(90)
circle(40, 180)
goto(170, -210)
goto(170, -190)
goto(160, -210)

# переходимо на координати ока
up()
goto(110, -184)
down()

# малюмєо око
dot(10)

# переходимо на координати сонця
up()
goto(-120, 160)
down()

# малюємо сонце
left(90)
circle(20)

done()